src/DataProcessors/ПереносОстатковМПЗИзБазы1С7/ПереносОстатковМПЗИзБазы1С7.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПереносОстатковМПЗИзБазы1С7</name>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <comment>Пароль</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Documents/ВводОстатковМПЗ/ВводОстатковМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатковМПЗ</name>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ИнвентаризацияМПЗ/ИнвентаризацияМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИнвентаризацияМПЗ</name>
  <posting>Deny</posting>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВПроизводстве</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВПроизводствеНеВРаботе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ПереносОстатковМПЗИзБазы1С7/Forms/Форма/Module.bsl
&НаСервере
Функция НайтиМестоХраненияПоНаименованию(Наименование)
Возврат(Справочники.МестаХранения.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаСервере
Функция НайтиПолуфабрикатПоНаименованию(Наименование)
Возврат(Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаСервере
Функция НайтиМатериалПоНаименованию(Наименование)
Возврат(Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаСервере
Процедура СоздатьВводОстатковМПЗ(Автор)
ВводОстатковМПЗ = Документы.ВводОстатковМПЗ.СоздатьДокумент();
ВводОстатковМПЗ.Автор = ПараметрыСеанса.Пользователь;
ВводОстатковМПЗ.Дата = ТекущаяДата();
ВводОстатковМПЗ.МестоХранения = МестоХранения;
ВводОстатковМПЗ.Комментарий = "Инвентаризация №"+НомерДокументаИнвентаризации+", автор документа "+Автор;
	Для каждого ТЧ_МПЗ Из ТаблицаМПЗ Цикл
	ТЧ = ВводОстатковМПЗ.ТабличнаяЧасть.Добавить();
		Если ТипЗнч(ТЧ_МПЗ.МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
		ТЧ.МПЗ = ТЧ_МПЗ.МПЗ;
		ТЧ.Количество = ПолучитьБазовоеКоличество(ТЧ_МПЗ.Количество,ТЧ_МПЗ.МПЗ.ОсновнаяЕдиницаИзмерения);
		ТЧ.Цена = ТЧ_МПЗ.Сумма/ТЧ_МПЗ.Количество;
		Иначе	
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
		ТЧ.МПЗ = ТЧ_МПЗ.МПЗ;
		ТЧ.Количество = ПолучитьБазовоеКоличество(ТЧ_МПЗ.Количество,ТЧ_МПЗ.МПЗ.ОсновнаяЕдиницаИзмерения);
		КонецЕсли;				
	КонецЦикла;
		Если ВводОстатковМПЗ.ТабличнаяЧасть.Количество() > 0 Тогда
		ВводОстатковМПЗ.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Перенос остатков завершён!");
		Иначе
		Сообщить("Табличная часть документа пустая! Сохранение отменено!");
		КонецЕсли;
КонецПроцедуры
 
&НаКлиенте
Процедура Соединиться(Команда)
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
	Возврат;
	КонецЕсли;
НастройкиОбменаДанными = ОбщийМодульСинхронизации.ПолучитьНастройкиОбменаДанными("Производство");
V7 = ОбщийМодульКлиент.ПодключитьсяК1С77(НастройкиОбменаДанными.ПутьКБазеДанных,Объект.ИмяПользователя,Объект.Пароль);
	Если V7 = Неопределено Тогда
	Возврат;	
	КонецЕсли;
Состояние("Обработка...",,"Проверка списка МПЗ..."); 			
Док = V7.CreateObject("Документ.ИнвентаризацияМПЗ");	
	Если Док.НайтиПоНомеру(СокрЛП(НомерДокументаИнвентаризации),Формат(ТекущаяДата(),"ДФ=dd.MM.yy")) = 1 Тогда
    Док.ВыбратьСтроки();
		Пока Док.ПолучитьСтроку() = 1 Цикл
			Если Док.Количество > 0 Тогда
				Если Док.ВидМПЗ.ПорядковыйНомер() = 1 Тогда 
				МПЗ = НайтиМатериалПоНаименованию(Док.МПЗ.Наименование);
					Если Не МПЗ.Пустая() Тогда
					ТЧ = ТаблицаМПЗ.Добавить();
					ТЧ.МПЗ = МПЗ;
					ТЧ.Количество = Док.Количество;
					ТЧ.Сумма = Док.Сумма;
					Иначе
					Сообщить(СокрЛП(Док.МПЗ.Наименование)+" - материал не найден!");
					КонецЕсли; 
				Иначе	
				МПЗ = НайтиПолуфабрикатПоНаименованию(Док.МПЗ.Наименование);
					Если Не МПЗ.Пустая() Тогда
					ТЧ = ТаблицаМПЗ.Добавить();
					ТЧ.МПЗ = МПЗ;
					ТЧ.Количество = Док.Количество;
					Иначе
					Сообщить(СокрЛП(Док.МПЗ.Наименование)+" - полуфабрикат не найден!");
					КонецЕсли; 
				КонецЕсли;			
			КонецЕсли; 			
		КонецЦикла;
	Состояние("Обработка...",,"Создание ввода остатков МПЗ..."); 
	СоздатьВводОстатковМПЗ(Док.Автор.Наименование);
	Иначе
	Сообщить("Инвентаризация не найдена!");
	КонецЕсли;
КонецПроцедуры
